dictionary = {
    'А': 'A',
    'а': 'a',
    'Б': 'B',
    'б': 'b',
    'В': 'V',
    'в': 'v',
    'Г': 'Ğ',
    'г': 'ğ',
    'Ґ': 'G',
    'ґ': 'g',
    'Д': 'D',
    'д': 'd',
    'Е': 'E',
    'е': 'e',
    'Є': 'Je',
    'є': 'je',
    'Ж': 'Ž',
    'ж': 'ž',
    'З': 'Z',
    'з': 'z',
    'И': 'Y',
    'и': 'y',
    'І': 'I',
    'і': 'i',
    'Ї': 'Ï',
    'ї': 'ï',
    'Й': 'J',
    'й': 'j',
    'К': 'K',
    'к': 'k',
    'Л': 'L',
    'л': 'l',
    'М': 'M',
    'м': 'm',
    'Н': 'N',
    'н': 'n',
    'О': 'O',
    'о': 'o',
    'П': 'P',
    'п': 'p',
    'Р': 'R',
    'р': 'r',
    'С': 'S',
    'с': 's',
    'Т': 'T',
    'т': 't',
    'У': 'U',
    'у': 'u',
    'Ф': 'F',
    'ф': 'f',
    'Х': 'X',
    'х': 'x',
    'Ц': 'C',
    'ц': 'c',
    'Ч': 'Č',
    'ч': 'č',
    'Ш': 'Š',
    'ш': 'š',
    'Щ': 'Ŝ',
    'щ': 'ŝ',
    'ь': 'j',
    'Ь': 'J',
    'Ю': 'Ju',
    'ю': 'ju',
    'Я': 'Ja',
    'я': 'ja',
    # 'Ё': 'Ö',
    # 'ё': 'ö',
    # 'Є́': 'Jé',
    # 'є́': 'jé',
    # 'І': 'Î',
    # 'ɪ': 'î',
    # 'Í': 'Í',
    # 'í': 'í',
    # 'Ў': 'Ŭ',
    # 'ў': 'ŭ',
    # 'Ȣ': 'Ȣ',
    # 'ȣ': 'ȣ',
    # 'Ȣ': 'Ȣ',
    # 'ȣ': 'ȣ',
    # 'Џ': 'ǅ',
    # 'џ': 'ǆ',
    # 'Ъ': 'Ǒ',
    # 'ъ': 'ǒ',
    # 'Ы': 'Ɏ',
    # 'ы': 'ɏ',
    # 'Ѣ': 'Ė',
    # 'ѣ': 'ė',
    # 'Э': 'Ē',
    # 'э': 'ē',
    # 'Ѫ': 'Ü',
    # 'ѫ': 'ü',
    # 'Ѧ': 'Ä',
    # 'ѧ': 'ä',
    # 'Ѯ': 'Ƙ',
    # 'ѯ': 'ƙ',
    # 'Ѱ': 'Ƥ',
    # 'ѱ': 'ƥ',
    # 'Ѳ': 'Ḟ',
    # 'ѳ': 'ḟ',
    # 'Ѵ': 'Ỳ',
    # 'ѵ': 'ỳ',
    # 'G': 'Ġ',
    # 'g': 'ġ',
    # 'J': 'Ǐ',
    # 'j': 'ǐ',
}

list_with_letter_j = [
    ('бй', 'b’j'),
    ('бЙ', 'b’J'),
    ('БЙ', 'B’J'),
    ('Бй', 'B’j'),

    ('вй', 'v’j'),
    ('вЙ', 'v’J'),
    ('ВЙ', 'V’J'),
    ('Вй', 'V’j'),

    ('гй', 'ğ’j'),
    ('гЙ', 'ğ’J'),
    ('ГЙ', 'Ğ’J'),
    ('Гй', 'Ğ’j'),

    ('ґй', 'g’j'),
    ('ґЙ', 'g’J'),
    ('ҐЙ', 'G’J'),
    ('Ґй', 'G’j'),

    ('дй', 'd’j'),
    ('дЙ', 'd’J'),
    ('ДЙ', 'D’J'),
    ('Дй', 'D’j'),

    ('жй', 'ž’j'),
    ('жЙ', 'ž’J'),
    ('ЖЙ', 'Ž’J'),
    ('Жй', 'Ž’j'),

    ('зй', 'z’j'),
    ('зЙ', 'z’J'),
    ('ЗЙ', 'Z’J'),
    ('Зй', 'Z’j'),

    ('кй', 'k’j'),
    ('кЙ', 'k’J'),
    ('КЙ', 'K’J'),
    ('Кй', 'K’j'),

    ('лй', 'l’j'),
    ('лЙ', 'l’J'),
    ('ЛЙ', 'L’J'),
    ('Лй', 'L’j'),

    ('мй', 'm’j'),
    ('мЙ', 'm’J'),
    ('МЙ', 'M’J'),
    ('Мй', 'M’j'),

    ('нй', 'n’j'),
    ('нЙ', 'n’J'),
    ('НЙ', 'N’J'),
    ('Нй', 'N’j'),

    ('пй', 'p’j'),
    ('пЙ', 'p’J'),
    ('ПЙ', 'P’J'),
    ('Пй', 'P’j'),

    ('рй', 'r’j'),
    ('рЙ', 'r’J'),
    ('РЙ', 'R’J'),
    ('Рй', 'R’j'),

    ('сй', 's’j'),
    ('сЙ', 's’J'),
    ('СЙ', 'S’J'),
    ('Сй', 'S’j'),

    ('тй', 't’j'),
    ('тЙ', 't’J'),
    ('ТЙ', 'T’J'),
    ('Тй', 'T’j'),

    ('фй', 'f’j'),
    ('фЙ', 'f’J'),
    ('ФЙ', 'F’J'),
    ('Фй', 'F’j'),

    ('хй', 'x’j'),
    ('хЙ', 'x’J'),
    ('ХЙ', 'X’J'),
    ('Хй', 'X’j'),

    ('цй', 'c’j'),
    ('цЙ', 'c’J'),
    ('ЦЙ', 'C’J'),
    ('Цй', 'C’j'),

    ('чй', 'č’j'),
    ('чЙ', 'č’J'),
    ('ЧЙ', 'Č’J'),
    ('Чй', 'Č’j'),

    ('шй', 'š’j'),
    ('шЙ', 'š’J'),
    ('ШЙ', 'Š’J'),
    ('Шй', 'Š’j'),

    ('џй', 'ǆ’j'),
    ('џЙ', 'ǆ’J'),
    ('ЏЙ', 'ǅ’J'),
    ('Џй', 'ǅ’j'),

    ('ѯй', 'ƙ’j'),
    ('ѯЙ', 'ƙ’J'),
    ('ѮЙ', 'Ƙ’J'),
    ('Ѯй', 'Ƙ’j'),

    ('ѱй', 'ƥ’j'),
    ('ѱЙ', 'ƥ’J'),
    ('ѰЙ', 'Ƥ’J'),
    ('Ѱй', 'Ƥ’j'),

    ('ѳй', 'ḟ’j'),
    ('ѳЙ', 'ḟ’J'),
    ('ѲЙ', 'Ḟ’J'),
    ('Ѳй', 'Ḟ’j'),

    ('gй', 'ġ’j'),
    ('gЙ', 'ġ’J'),
    ('GЙ', 'Ġ’J'),
    ('Gй', 'Ġ’j'),

    ('йа', 'j’a'),
    ('йА', 'j’A'),
    ('ЙА', 'J’A'),
    ('Йа', 'J’a'),

    ('йе', 'j’e'),
    ('йЕ', 'j’E'),
    ('ЙЕ', 'J’E'),
    ('Йе', 'J’e'),

    ('йу', 'j’u'),
    ('йУ', 'j’U'),
    ('ЙУ', 'J’U'),
    ('Йу', 'J’u'),

    ('ьа', 'j’a'),
    ('ьА', 'j’A'),
    ('ЬА', 'J’A'),
    ('Ьа', 'J’a'),

    ('ье', 'j’e'),
    ('ьЕ', 'j’E'),
    ('ЬЕ', 'J’E'),
    ('Ье', 'J’e'),

    ('ьу', 'j’u'),
    ('ьУ', 'j’U'),
    ('ЬУ', 'J’U'),
    ('Ьу', 'J’u'),

    ('ай', 'aj’'),
    ('аЙ', 'aJ’'),
    ('АЙ', 'AJ’'),
    ('Ай', 'Aj’'),

    ('ей', 'ej’'),
    ('еЙ', 'eJ’'),
    ('ЕЙ', 'EJ’'),
    ('Ей', 'Ej’'),

    ('уй', 'uj’'),
    ('уЙ', 'uJ’'),
    ('УЙ', 'UJ’'),
    ('Уй', 'Uj’'),
]


def text_translate_dstu_a(text):
    word_list = text.split()
    translated_text = []

    for word in word_list:
        translated_word = word_translate(word)
        translated_text.append(translated_word)

    translated_text = " ".join(translated_text)
    return translated_text


def word_translate(word):

    translated_word = []

    for cyrillic, latin in list_with_letter_j:
        word = word.replace(cyrillic, latin)

    for letter in word:
        if letter in dictionary:
            translated_word.append(dictionary[letter])
        else:
            translated_word.append(letter)

    translated_word = "".join(translated_word)
    return translated_word
    